---
title: LinkedResourceOpenedEventArgs
classe: Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# LinkedResourceOpenedEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String LinkedResourcePathName { get; }` | `linkedResourceOpenedEventArgs.LinkedResourcePathName` | String |
| `ExternalResourceType ResourceType { get; }` | `linkedResourceOpenedEventArgs.ResourceType` | ExternalResourceType |
| `ElementId ResourceTypeId { get; }` | `linkedResourceOpenedEventArgs.ResourceTypeId` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```